import { Experience } from '../types/type';

export const ExperienceData: Experience[] = [
  {
    period: '2011/04 ~ 2015/03',
    role: '大学生時代',
    description:
      '流れるままに大学生をしていました。経営学部でしたが目立った活動はなく、ほぼアルバイトをしていました。就職活動時に将来の自分がどうなりたいのかを見つめ直して、エンジニアを志すようになりました。',
  },
  {
    period: '2015/04 ~ 2019/03',
    role: '専門学生時代',
    description:
      '大学卒業後、エンジニアを目指すため、専門学校でプログラミングを学びました。資格至上主義な学校だったので周りより早い段階で応用情報処理技術者を取得しました。その後、資格を取ってなんとなくで就職するんだろうなと考えていたのですが、ある時点から本格的に勉強しようと考え始めて、独学でいろいろと勉強をし始めました。',
  },
  {
    period: '2018/06 ~',
    role: 'フロントエンドエンジニア',
    description:
      'インターンを通して、アプリ開発を経験しました。TOGOというテイクアウトコーヒーのアプリのWeb管理画面の開発を担当しました。React / Reduxを用いたフロントサイドからFirebaseを使用したサーバサイドの開発を行い、成長をすることができました。また、エンジニア仲間が増えたのも素晴らしいことでした。現在は副業として参画させていただいており、TypeScriptとReactを用いて新サービスのWeb管理画面の開発を行っています',
  },
  {
    period: '2019/04 ~ 2020/05',
    role: 'カスタムエンジニア',
    description: '都内SaaS開発企業にてカスタムエンジニアとして働いています。顧客ごとのカスタム依頼に対応する日々を送っています。メインで触っているのはSQLとVBScriptになります。周りのレベルが高く、やさしさに満ちた環境ではありますが、チャレンジが出来る刺激的な環境に身を置きたいと思い、現在転職活動中です。',
  },
];
